#### PANDAS-DataFrame And Series

Pandas is a powerful data manipulation library in python,widely used for data analysis and data cleaning.it provides two primary data structures:Series and DataFrame.A Series is a one-dimensional array-ike object,while a DataFrame is a two dimensional ,size mutable and potentially heterogeneous tabular data structure with labeled axes(rows and columns).

In [1]:
!pip install pandas

Requirement already satisfied: pandas in d:\python\venv_312\lib\site-packages (2.3.2)
Requirement already satisfied: numpy>=1.26.0 in d:\python\venv_312\lib\site-packages (from pandas) (2.3.2)
Requirement already satisfied: python-dateutil>=2.8.2 in d:\python\venv_312\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in d:\python\venv_312\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in d:\python\venv_312\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in d:\python\venv_312\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [4]:
##  Series 
# A Pandas series is a one dimensional array-like object that can hold any data type.It is similar to acolumn in a table.

import pandas as pd
data=[1,2,3,4,5]
series=pd.Series(data)
print("Series \n",series)

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
## Create a series from dictionary
data={'a':1,'b':2,'c':3}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [6]:
data=[10,20,30,]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [15]:
## DataFrame
## Create a DataFrame from a dictionary of lists

data={
    'Name':['Krish','John','Jack'],
    'Age':[25,30,26],
    'City':['Banglore','New york','Florida']
}
df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age      City
0  Krish   25  Banglore
1   John   30  New york
2   Jack   26   Florida
<class 'pandas.core.frame.DataFrame'>

In [9]:
import numpy as np
np.array(df)

array([['Krish', 25, 'Banglore'],
       ['John', 30, 'New york'],
       ['Jack', 26, 'Florida']], dtype=object)

In [10]:
## Create a dataframe from a list of dictionaries

data=[
    {'Name':'Krish','Age':24,'City':'Banglore'},
    {'Name':'John','Age':24,'City':'Banglore'},
    {'Name':'Jack','Age':24,'City':'Banglore'},
    {'Name':'Peter','Age':24,'City':'Banglore'}
]
df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age      City
0  Krish   24  Banglore
1   John   24  Banglore
2   Jack   24  Banglore
3  Peter   24  Banglore
<class 'pandas.core.frame.DataFrame'>

In [ ]:
df=pd.read_csv('sales_data.csv')
print(df.head(5))   ## top 5 records

                           ## Simple Calculator
0                           # Simple Calculator
1   num1 = float(input("Enter first number: "))
2  num2 = float(input("Enter second number: "))
3            # Performing arithmetic operations
4                         additon = num1 + num2

In [ ]:
df.tail(5) # last 5

     ## Simple Calculator
14  print(multuplication)
15        print(division)
16  print(floor_division)
17         print(modulus)
18  print(exponentiation)

In [ ]:
## Accessing data from DataFrame

data

{'Name': ['Krish', 'John', 'Jack'],
 'Age': [25, 30, 26],
 'City': ['Banglore', 'New york', 'Florida']}

In [17]:
df

    Name  Age      City
0  Krish   25  Banglore
1   John   30  New york
2   Jack   26   Florida

In [18]:
df['Name']

0    Krish
1     John
2     Jack
Name: Name, dtype: object

In [21]:
type(df['Name'])

pandas.core.series.Series

In [22]:
df['Name']

0    Krish
1     John
2     Jack
Name: Name, dtype: object

In [ ]:
df.loc[0]  ## row index

Name       Krish
Age           25
City    Banglore
Name: 0, dtype: object

In [24]:
df.loc[0][0]

C:\Users\Fathi\AppData\Local\Temp\ipykernel_17420\2527876973.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][0]

'Krish'

In [25]:
df.loc[0][2]

C:\Users\Fathi\AppData\Local\Temp\ipykernel_17420\2880214942.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][2]

'Banglore'

In [28]:
df.iloc[0]

Name       Krish
Age           25
City    Banglore
Name: 0, dtype: object

In [26]:
# Accessing specified eleemt
df

    Name  Age      City
0  Krish   25  Banglore
1   John   30  New york
2   Jack   26   Florida

In [31]:
df.at[2,'Age']

np.int64(26)

In [33]:
print(df.at[2,'Name'])

Jack

In [34]:
## Accessing a specified element using iat

df.iat[2,2]

'Florida'

In [35]:
df

    Name  Age      City
0  Krish   25  Banglore
1   John   30  New york
2   Jack   26   Florida

In [36]:
## data manipulation with DataFrame
df

    Name  Age      City
0  Krish   25  Banglore
1   John   30  New york
2   Jack   26   Florida

In [ ]:
## Addign a column

df['Salary']=[5000,6000,7000]
df

    Name  Age      City  Salary
0  Krish   25  Banglore    5000
1   John   30  New york    6000
2   Jack   26   Florida    7000

In [ ]:
## Remove a column
 
df.drop('Salary',axis=1)      # not saved

    Name  Age      City
0  Krish   25  Banglore
1   John   30  New york
2   Jack   26   Florida

In [41]:
df

    Name  Age      City  Salary
0  Krish   25  Banglore    5000
1   John   30  New york    6000
2   Jack   26   Florida    7000

In [42]:
# to save

df.drop('Salary',axis=1,inplace=True)

In [43]:
df

    Name  Age      City
0  Krish   25  Banglore
1   John   30  New york
2   Jack   26   Florida

In [44]:
## Add age to column

df['Age']=df['Age']+1
df

    Name  Age      City
0  Krish   26  Banglore
1   John   31  New york
2   Jack   27   Florida

In [48]:
df.drop(0,inplace=True)

In [49]:
df

   Name  Age      City
1  John   31  New york
2  Jack   27   Florida